Revit 2027 API
SunAndShadowSettings.NumberOfFrames Property
 Identifies the total number of animation frames for a single-day or multi-day study.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NumberOfFrames { get; }
Public ReadOnly Property NumberOfFrames As Double
	Get
public:
property double NumberOfFrames {
	double get ();
}
member NumberOfFrames : float with get
Property Value
Double
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace